#Revisión general de los datos.

In [1]:
#Tratamiento y exportación de datos
#importamos librerias
import pandas as pd    # Librería para tablas y tratamiento de datos.
#Para una visualización completa de todas las columnas:
pd.set_option('display.max_columns', None)

In [2]:

df_clientes=pd.read_csv('clientes.csv')
df_clientes.sample(5)

    id_cliente  nombre   apellido             ciudad
5        C0006   Elena      López    Braga, Portugal
299      C0300  Carmen      Pérez   Aveiro, Portugal
21       C0022   María  Rodríguez   Aveiro, Portugal
58       C0059  Carmen    Sánchez    Sevilla, España
122      C0123     Ana   González  Toulouse, Francia

In [3]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  300 non-null    object
 1   nombre      300 non-null    object
 2   apellido    300 non-null    object
 3   ciudad      300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [13]:
df_clientes.duplicated().sum()

0

In [4]:
df_productos=pd.read_csv('productos.csv')
df_productos.sample(5)

,id_producto,precio,categoria,descripcion
554,P0555,64.37 €,Books,NRiNdUaFhdL1wI2eDd7tzW29bMcogzbp3chVrCyph60jLu...
425,P0426,55.63 €,Electronics,aiK5iNl6oi5VktIIWD42bECYuU8wMjcX4ZodxdhLhB5BLd...
461,P0462,1.26 €,Books,0qPyzOBFfd3oKM4MHgu0P10A4ZLqyLyKPzLZPrUQWrmO6T...
268,P0269,74.18 €,Home & Kitchen,ZPhbmFr3PyFOnFPlEKIWH4ZD10oIoX8Voqis8479iNsKVV...
433,P0434,70.52 €,Clothing,wcK3tVDpAv0p8vvW4GNPVyaYjpEs0FyrVRyEeNktmSviY1...

In [14]:
df_productos.duplicated().sum()

0

In [5]:
df_productos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_producto  600 non-null    object
 1   precio       600 non-null    object
 2   categoria    600 non-null    object
 3   descripcion  600 non-null    object
dtypes: object(4)
memory usage: 18.9+ KB

In [6]:
df_ventas=pd.read_csv('ventas.csv')
df_ventas.sample(5)

      id_venta id_producto  cantidad       fecha id_cliente
55683  V004084       P0040         5  2023-05-24      C0076
76165  V002669       P0258         6  2021-01-23      C0211
41479  V000658       P0003         7  2022-07-18      C0248
53978  V000069       P0163         4  2021-01-27      C0074
7166   V005240       P0180         8  2023-10-12      C0067

In [7]:
df_ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.1+ MB

In [16]:
df_ventas.duplicated().sum()

80

Pasaremos todos los datos a un solo dataframe:

In [26]:
merge1_dfs=df_ventas.merge(df_clientes, on ="id_cliente")

In [27]:
merge1_dfs.head()

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,"Niza, Francia"
1,V003181,P0165,9,2022-09-12,C0004,Marta,López,"Valencia, España"
2,V000311,P0194,10,2020-12-02,C0156,Sofía,Sánchez,"Santander, España"
3,V002787,P0167,1,2023-07-22,C0058,Clara,Hernández,"Barcelona, España"
4,V002726,P0417,10,2022-04-10,C0099,Elena,García,"Lisboa, Portugal"

In [28]:
merge2_dfs=merge1_dfs.merge(df_productos, on="id_producto")

In [29]:
merge2_dfs.head()

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,"Niza, Francia",58.91 €,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...
1,V003181,P0165,9,2022-09-12,C0004,Marta,López,"Valencia, España",93.20 €,Books,Wk3wS8V6kUhy0nWnknaaSiS3oQJkfAf8pOK0GAbRqMwQ3L...
2,V000311,P0194,10,2020-12-02,C0156,Sofía,Sánchez,"Santander, España",43.38 €,Clothing,eOnRpP74GAXrDk8UMb6QgmSJscSgpT9B5B9C1PA1TB9Xc5...
3,V002787,P0167,1,2023-07-22,C0058,Clara,Hernández,"Barcelona, España",88.17 €,Sports & Outdoors,y8Efq93OmWZtzYYgcAN3Mw5xQmiwA0hj7AIzQ8Mqba5oYK...
4,V002726,P0417,10,2022-04-10,C0099,Elena,García,"Lisboa, Portugal",60.69 €,Books,EmQk26vUd7mOMAKQHwUVk1Qm4rwUZC1vHOBk9pqI565P7v...

In [30]:
merge2_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
 5   nombre       80000 non-null  object
 6   apellido     80000 non-null  object
 7   ciudad       80000 non-null  object
 8   precio       80000 non-null  object
 9   categoria    80000 non-null  object
 10  descripcion  80000 non-null  object
dtypes: int64(1), object(10)
memory usage: 6.7+ MB

In [31]:
#Vamos a separarcolumnas siguiendo el proceso de normalizacion de una tabla:
#Separaremos la columna ciudad en dos: ciudad y país.
merge2_dfs[['ciudad','pais']]=merge2_dfs.ciudad.str.split(', ', expand=True)
merge2_dfs.head(1)

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion,pais
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,Niza,58.91 €,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...,Francia

In [33]:
#separaremos '€' de la columna precios y ccambiaremos su tipo de valor a float.
merge2_dfs.precio=merge2_dfs.precio.str.replace('€','')
merge2_dfs.head(1)

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion,pais
0,V004849,P0173,4,2024-05-16,C0203,Lucía,González,Niza,58.91,Books,UASpWkt14nzeB6fkBDwO42wQiCijnSTcizwW1eB1yy0Rmy...,Francia

In [34]:
merge2_dfs.precio=merge2_dfs.precio.astype(float)

In [36]:
merge2_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
 5   nombre       80000 non-null  object
 6   apellido     80000 non-null  object
 7   ciudad       80000 non-null  object
 8   precio       80000 non-null  float64
 9   categoria    80000 non-null  object
 10  descripcion  80000 non-null  object
 11  pais         80000 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 7.3+ MB

In [37]:
#Procedemos a guardar el df _limpio:
merge2_dfs.to_csv('clientes_productos_ventas.csv')

In [38]:
#Revisamos las filas duplicadas:
merge2_dfs.duplicated().sum()

80

In [50]:
#Queremos saber cuales son las filas duplicadas para su revisión:
duplicados=merge2_dfs[merge2_dfs.duplicated()]
duplicados

,id_venta,id_producto,cantidad,fecha,id_cliente,nombre,apellido,ciudad,precio,categoria,descripcion,pais
6694,V004648,P0434,5,2021-06-28,C0263,Lucía,Martínez,Madrid,70.52,Clothing,wcK3tVDpAv0p8vvW4GNPVyaYjpEs0FyrVRyEeNktmSviY1...,España
8773,V001670,P0483,4,2020-07-31,C0017,Clara,Sánchez,Marsella,77.83,Home & Kitchen,jflLzAkMBvyatpYaNHJ4KOxbh4t93TJXEEGevQsO1yZGD8...,Francia
10797,V004342,P0336,3,2020-05-27,C0267,Marta,García,Lyon,39.91,Electronics,RNyX4ZO4vC3AdnyYKALRekQ0aT9U4KRg4z6TJ4frasnA4n...,Francia
10967,V004143,P0373,4,2021-11-18,C0300,Carmen,Pérez,Aveiro,95.81,Electronics,1VNUbcDk2e1sBXHN4m3MDXN4DlpmxUVswxgeZChaJviGfi...,Portugal
12262,V003463,P0181,6,2021-06-16,C0070,Clara,González,Niza,54.23,Sports & Outdoors,eyWG0Leb7IRmrdS59tRRm1sKAiVCMBd75wS2QzBl84trpC...,Francia
...,...,...,...,...,...,...,...,...,...,...,...,...
78821,V004712,P0307,7,2023-09-29,C0076,Lucía,Fernández,Marsella,22.60,Clothing,3xTOqUESd3Qp23tayHPapw8KDAMV05UJO6eCdTiysnXK8o...,Francia
79104,V004713,P0559,10,2020-03-16,C0046,Sofía,García,Coímbra,21.00,Clothing,R6lnb9VpZjdEOgaqBFmM8Ep9qFZNvbmHpid9EzWeDBcU9Q...,Portugal
79439,V006831,P0263,2,2022-10-30,C0168,Laura,Rodríguez,Aveiro,70.09,Home & Kitchen,FcGvMZ203DzyFTi0TpCBRR02OYTh41XG5VRDWtGFhXGOtL...,Portugal
79734,V003482,P0388,7,2023-07-22,C0099,Elena,García,Lisboa,55.68,Home & Kitchen,pWfy0gos00PX6DmAnKfZjocjE85h8SFHOytpvFiIloWtoL...,Portugal
79962,V000454,P0193,9,2023-11-16,C0032,Laura,López,Barcelona,41.32,Clothing,SgRLGH75Me2tlGSfkfgUUrB2FWQRDbdh9eIgXULBADVvN6...,España

In [51]:
#Eliminamos las filas repetidas y creamos un df_nuevo:
df_limpio=merge2_dfs.drop_duplicates()

In [52]:
df_limpio.duplicated().sum()

0

Sacamos los valores unicos para una última revision y para la separación por categorias de cada columna:

In [55]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 79920 entries, 0 to 79999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     79920 non-null  object
 1   id_producto  79920 non-null  object
 2   cantidad     79920 non-null  int64
 3   fecha        79920 non-null  object
 4   id_cliente   79920 non-null  object
 5   nombre       79920 non-null  object
 6   apellido     79920 non-null  object
 7   ciudad       79920 non-null  object
 8   precio       79920 non-null  float64
 9   categoria    79920 non-null  object
 10  descripcion  79920 non-null  object
 11  pais         79920 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 7.9+ MB

In [54]:
for columna in df_limpio.columns:
    display(df_limpio[columna].value_counts())

id_venta
V005860    23
V004944    23
V002430    23
V000395    22
V005828    21
           ..
V000561     2
V000130     1
V001199     1
V002861     1
V000696     1
Name: count, Length: 8000, dtype: int64

id_producto
P0057    209
P0269    208
P0193    201
P0026    199
P0068    197
        ...
P0315    135
P0249    134
P0147    132
P0445    131
P0532    131
Name: count, Length: 480, dtype: int64

cantidad
9     8134
6     8101
4     8072
10    8031
1     7998
2     7967
3     7951
7     7927
5     7900
8     7839
Name: count, dtype: int64

fecha
2021-12-22    149
2022-12-04    140
2020-11-30    130
2023-09-20    126
2020-01-19    124
             ...
2024-04-01      6
2023-04-03      6
2021-01-22      6
2021-11-09      3
2023-05-14      2
Name: count, Length: 1638, dtype: int64

id_cliente
C0092    552
C0069    551
C0214    524
C0065    516
C0071    514
        ...
C0021    229
C0208    227
C0248    223
C0199    213
C0054    200
Name: count, Length: 210, dtype: int64

nombre
María     11362
Ana       10926
Marta      9527
Elena      9168
Sofía      7641
Carmen     6909
Laura      6788
Lucía      6399
Clara      5779
Julia      5421
Name: count, dtype: int64

apellido
Rodríguez    10618
García        9453
Fernández     8522
Sánchez       8285
Martínez      8256
Pérez         8151
López         7761
Hernández     6553
Gómez         6388
González      5933
Name: count, dtype: int64

ciudad
Sevilla      5811
Lyon         5666
Marsella     5474
Bilbao       4650
Málaga       4603
Toulouse     4573
Aveiro       4457
Lisboa       4203
Granada      4047
París        3984
Zaragoza     3954
Niza         3751
Madrid       3740
Oporto       3635
Barcelona    3433
Coímbra      3174
Braga        3066
Murcia       2956
Valencia     2840
Santander    1903
Name: count, dtype: int64

precio
58.91    466
43.80    360
85.45    346
94.87    342
69.00    337
        ...
9.05     137
12.45    135
8.49     134
58.79    132
46.07    131
Name: count, Length: 469, dtype: int64

categoria
Clothing             17593
Sports & Outdoors    16975
Electronics          15616
Books                14950
Home & Kitchen       14786
Name: count, dtype: int64

descripcion
dcviGSuHA8rW4q9Yp1MJSSY3LJIw5B0XYyFD7GzlLIQIGGK3xb    209
ZPhbmFr3PyFOnFPlEKIWH4ZD10oIoX8Voqis8479iNsKVVeMvo    208
SgRLGH75Me2tlGSfkfgUUrB2FWQRDbdh9eIgXULBADVvN6pd9B    201
Xox9iFw7bo4HWmnbZ8i0RMJ8VUlgk8DNj0gPLH5GsZmYGruuPA    199
qHZ5sogxCc4GMeJEFOOZCPpLvgit1nmKhLZyHBWrxTzzlkVPkL    197
                                                     ...
A7PtqYPRb7JkY8oqomD29K0M6iwKXaECLs3ZrE4VeNL5wGvJZp    135
UmjVibYp1667NUO2XbjROoOrt5cI778aI7XWZhuC5t1wjEzsDk    134
1X3COzOlSvb5JrDAMCx8820Qp6ksCxHa0GFahfyzdDHmuCKUHF    132
DFIkrVpCfqdO4DjjaOq7nXguZLE5VhgYsjlQVe4yVoXoBnOkS3    131
TztFb2Y3zLtYvjHbCKEAD9XQe1ccXwkxyPX6TryMBfXAHNSweO    131
Name: count, Length: 480, dtype: int64

pais
España      37937
Francia     23448
Portugal    18535
Name: count, dtype: int64

In [57]:
#Separamos en variables categóricas y numericas :
df_categoricas=df_limpio.select_dtypes(include='object')
df_numericas=df_limpio.select_dtypes(include=['int','float'])

In [58]:
#Sacamos las principales estadísticas:
df_categoricas.describe().T

,count,unique,top,freq
id_venta,79920,8000,V005860,23
id_producto,79920,480,P0057,209
fecha,79920,1638,2021-12-22,149
id_cliente,79920,210,C0092,552
nombre,79920,10,María,11362
apellido,79920,10,Rodríguez,10618
ciudad,79920,20,Sevilla,5811
categoria,79920,5,Clothing,17593
descripcion,79920,480,dcviGSuHA8rW4q9Yp1MJSSY3LJIw5B0XYyFD7GzlLIQIGG...,209
pais,79920,3,España,37937

In [59]:
df_numericas.describe().T

            count       mean        std   min    25%    50%    75%    max
cantidad  79920.0   5.504204   2.874844  1.00   3.00   6.00   8.00  10.00
precio    79920.0  48.600795  27.539365  1.21  25.54  47.82  72.71  99.72